

#ifndef __CPHY_SYS_ERR_H__
#define __CPHY_SYS_ERR_H__


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define CPHY_SYSTEM_ERROR( mod_id, arg1, arg2, arg3, arg3_len ) \
    system_error((unsigned int)mod_id, (unsigned int)arg1, (unsigned int)arg2, (char *)arg3, (unsigned int)arg3_len);

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/* field id定义只允许添加，不允许删除，枚举定义删除之后，id值需要保留，新添加id需要跳过删除id */
typedef enum{
    /* CSDR FIELD IDs*/
    SYSERR_CSDR_FIELD_BEGIN                 = (0xd0000000),
    SYSERR_CSDR_WATCHDOG                    = SYSERR_CSDR_FIELD_BEGIN,
    SYSERR_CSDR_FIELD_END                   = (0xd0ffffff),

    /* CPHY MBX FIELD IDs*/
    SYSERR_CPHY_MBX_FIELD_BEGIN             = (0xd1000000),
    SYSERR_CPHY_MBX_FIELD_READ_MBX          = SYSERR_CPHY_MBX_FIELD_BEGIN,
    SYSERR_CPHY_MBX_FIELD_WRITE_MBX         = (0xd1000001),
    SYSERR_CPHY_MBX_FIELD_END               = (0xd1ffffff),

}SYSERR_CPHY_MOD_ENUM;

typedef VOS_UINT32 SYSERR_CPHY_MOD_ENUM_UINT32;

/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  9 全局变量声明
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

extern void system_error (unsigned int mod_id, unsigned int arg1, unsigned int arg2, char *data, unsigned int length);










#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of cphy_sys_err.h */

